tap "beeftornado/rmtree"
tap "databricks/tap"
tap "ggpeti/rmrec"

# Core utilities
brew "chezmoi"
brew "fzf"
brew "gh"
brew "htop"
brew "jq"
brew "ripgrep"
brew "tree"
brew "zoxide"

# Development tools
brew "docker"
brew "docker-compose"
brew "neovim"
brew "lazygit"
brew "tmux"
brew "mypy"
brew "yamllint"

# Languages & runtimes
brew "node@18"
brew "node@20"
brew "openjdk@17"
brew "python@3.9"
brew "uv"
brew "yarn"
brew "pipx"

# Cloud & infrastructure
brew "awscli"
brew "azure-cli"
brew "databricks/tap/databricks"

# Databases
brew "postgresql@14", restart_service: :changed
brew "postgresql@17"  # Latest version for psql client

# Other tools
brew "apache-spark"
brew "putty"

# Dependencies (auto-installed by above, but listed for completeness)
brew "glib"
brew "cairo"
brew "harfbuzz"
brew "libtiff"

# GUI Applications
cask "claude-code"
cask "docker-desktop"
cask "warp"