tap "beeftornado/rmtree"
tap "databricks/tap"
tap "ggpeti/rmrec"
tap "homebrew/services"

# Core utilities
brew "chezmoi"
brew "fzf"
brew "gh"
brew "htop"
brew "jq"
brew "ripgrep"
brew "tree"
brew "zoxide"

# Development tools
brew "neovim"
brew "lazygit"
brew "tmux"
brew "mypy"
brew "yamllint"

# Languages & runtimes
brew "node@18"
brew "node@20"
brew "openjdk@17"
brew "python@3.9"
brew "uv"
brew "yarn"
brew "pipx"

# Cloud & infrastructure
brew "awscli"
brew "azure-cli"
brew "databricks/tap/databricks"

# Databases
brew "postgresql@14", restart_service: :changed

# Other tools
brew "apache-spark"
brew "putty"

# Dependencies (auto-installed by above, but listed for completeness)
brew "glib"
brew "cairo"
brew "harfbuzz"
brew "libtiff"

# VSCode extensions
vscode "anthropic.claude-code"
vscode "cymonk.sql-formatter"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "james-yu.latex-workshop"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "rvest.vs-code-prettier-eslint"
vscode "snowflake.snowflake-vsc"
vscode "vscodevim.vim"